from transcripe_service import TranscripeService
from llm_service import LLMService

import json

class PipeLine:

    """
    Pipeline to run the asr system

    there are 2 available llms:
    1- open_ai
    2- sambanova

    you can switch between them using the use parameter

    example:
        1- using open ai:     PipeLine(audio_path, output_path, use="open_ai").run()

        2- using sambanova:   PipeLine(audio_path, output_path, use="sambanova").run()

    output a json file named: output.json
    """

    def __init__(self, audio_path, output_file, use="open_ai"):
        self.whisper = TranscripeService()
        self.llm = LLMService()

        self.audio_path = audio_path
        self.output_file = output_file
        self.use = use

    def run(self):
        # text = self.whisper.transcribe(self.audio_path)
        text = "مثل ما ربيتكم يا ميزر  تب مني أنسى حليب واضحة  اللي رضحت أنا ويايا يولدي  أنا آسف يما  أنا ما قصدت جعلك  والدنيا كلها ما تعادل جعلت عندي  سامحيني يما  لا  لا يا ميزر  هذا بعد غلط  وهذا هو غلطك أنت بالذات  يا ميزر  أنت صرت ريال  وتفهم كل الأمور  يوم كان خالك يضحك علينا  كنت أطلب مني أنا  اللي أحاسبه  لأنت طمع وأخذ كل شي  والحين  تخلي يضحك على عمك  وانت تتفرج وساكت  يما انت حيرتيني بصراحة  أنا ما أني داري واش تبغين بالضبط  أنا كل ما أقول شي تقولي غلط غلط غلط  وين الصح  يا عمتي إذا كان كل شي غلط غلط  فعلاً زي ما قال ميزر وين الصح  الصح أنكم الحين تنامون  والصبح  لها رب يدبرها  وإن شاء الله إذا صار باتشر  كل بون البيت أبو مسامح  موسيقى  بامي  بامي  بامي  بامي  بامي  يما  ورحتك  ورحتك وحليتيني  يما وين  خيصة  خيصة  انتي لها الحين تبتين  تبين تسكتين ولا لينا بها رتبها العصا  لا يبا ليه  ليه هالثمسة عدت بيديك وطردت عيالك  دون عليك أمي  دون عليك أخوي جيك  عينتوا بيني أشلمكم روحي بيدك  علشان ترضون  لا يبا حن عيالك  ولو يصيبكم بالطبرة يبا عيوننا شهر تهار بالنوم  شهر تهار بالنوم  اسمحي يا بنتي  أنتي صحيح بنتي الشاطرة  قلبي على قلبت  وتحبيني وصد  لا تبا يبا  تبيني سؤال  أنا قود دايما  بنتي حسين صح الشاطرة  بنتي تحبني  وتحافظ على سلامتي  طبعا يا يبا  ولا علشان شذا ونبوت طردتهم كلهم  وخليتت عنتي الحالت عندي بالبيت  لا يبا هذي كلها وها  هذي نفس ما صلت علي النبي  يا بنتي لا تجيبين لي هالسيلة هذي يبا  ترى راسي يبي ينفجر منها  أقول  أقول ونبوت  انا الحقيقة  عندي راي  وندي اشاورت عليه  واخذ رايت  تاخذ رايت  اي اخذ رايت ونبوت  لا تستغربين  انا الحقيقة رجال عميد  وراسي يابس  و�ن ابخذ رأي أحد نبت  و لن ابشاور  لكن هالمسعله هاد  اقصد الموضوع هذا  اللي يودي  ياخد رأي رايت فيه  موضوع مهم جدا  اللي يسميه طيبة  انتي عارفة  ونبوث  البنته لتبرد  لازم تعرز  ولد يجيها  بي ابن حلال يطيق بابه  وهو يخطبها منه  ويحطيها  مهم تدوى نبوت  هذه سنة الحياة  يا ابنيتي  بس يبا  هذا عارف عارف ايش تبين تقولين  عارف وعارف ان انا كل شي  بس لا تستعجلين  تبين تسعلين من هو  هالولاد ومن هو  ولده ووش عنده  ووش يملك  ووش ما يملك  انا نبوت هالمراد كلها  باخصها وعارفها  ودارن عن كل شي  وانا  انا يا بنتي  الحقيقة اني  موافق علي  موافق علي  ايه ايه هم وافقين عليه  وانتي بعد الاعرفتي تبين توافقين عليه  والطيرين من الفرح  يعني يعني يبا سامحته  وش هو  سامحته  هوا انت تعرفين منه علشانه سامحه وللا  يبا بس بس  مو بميزر  ميزر  مين ابا اقولك لا  عمرسي جيبه يمذكر اسمها بس  موا جيب ذكر اسمها  لا تجب ان تكر اسمه ابد  الرجال اللي اخترته لتهادة  لازم تعرثين عليه  تدرين منهو  لا  ما ادري منهو  هذا هرشان ولد مغيس  اشتركوا في القناة  اشتركوا في القناة  زيد  ايه بتقول الكلام هذا  لا يسمعك ميزر يزعل منك  ربنا موجود يا زيد  ونعم بالله  ونعم بالله يا لطيف  صباح الخير  صباح النور يا زيد  مرحبا صباح الخير  اشو عندكم  وشو ازعل اذكرتيه يا لطيف  مافي شي  على ذنبكم شوي  لازم كل شي  اشو فيها زيد  اجلس اجلس انا علمك بكل شي  استريح  بس لا يكون  الاخ زيد عاثر بالكلام  اللي صار البارحة  هو بس كلامنا بالليل يا ميزر  ولا حالتنا دي اللي حنا فيها  الحين  ولا حال حصة وبوي  ولا والا  بس يا زيد بس  ولا يهمك واخوك  ربنا سبحانه وتعالى موجود  وهو الكريم وهو المدبر  ونعم بالله  ونعم بالله يا ميزر  لكن لازم نسعى  لازم نسعى بطريقة  علشان نجي تحل هالمشاكل  وشو هالسعيه اللي تبيه  ميزر  فكر بالحل اللي صرنا فيه  فكر ان ورانا طلب فلوس  بعد سوء زمان  فكر بالعمال اللي يبون حاسبونك  فكر بالمشاكل دي كلها  فكر فيها  لا حلال  يحل الامور هذي كلها في وقتها يا زيد  بس انت ما عليكون اخوك  الحين لازم  نروح العمي  وان شاء الله ان الله يحط في قلبها الرحمة  ويرضى عليك انت وعمتي  ويبارك لك في العرس وتنحل الامور هذي كلها  ابوي  تبي ابوي يرضى علي أنا وامي  انت الظاهر يا ميزر لايمكن يتبدل قلبك  انتبه المستحيل  يا شيخ يا زيد  يا زيد وانا اخوك  انت لا تكون متشائم لها الحد  توكر على الله وانا اخوك  ما فيه غيره هو الله سبحانه وتعالى  هو الكفير وهو الوكيل  بس مشكلاتنا لازمها سعي كبيرة  ميزر  اقل شي لازم نفكر بمعيشة الحريم  امك وامي  واختك  بس  ونحن  اعدمنا  نحن  انت  ادينا  اعدنا  انا  نحن  نحن  نحن  نحن  نحن "
        if self.use == "open_ai":
            output = self.llm.get_open_ai_response(text)
        else:
            output = self.llm.get_sambanova_response(text)


        # print()
        self.save_to_json(output)

    def save_to_json(self, output):

        if isinstance(output, str):
            output = output.replace("'", '"').replace('"{', '{').replace('}"', '}')
            output = json.loads(output)
        elif not isinstance(output, dict):
            raise ValueError("Output is not in a valid format (string or dictionary).")

        with open(self.output_file, 'w', encoding='utf-8') as f:
            json.dump(output, f, ensure_ascii=False, indent=4)


if __name__ == "__main__":

    audio_path = "test_audios/6k_SBA_100_2.wav"
    output_path = "output.json"

    PipeLine(audio_path, output_path, use="open_ai").run()

    print(f"output file saved to {output_path} GO check it!")
